### Groupby & Aggregations

In [14]:
import pandas as pd
import numpy as np

In [15]:
df = pd.read_csv('data/orders.csv')
df

   order_id product_name         category       city  sales  profit
0    152156           p1        Furniture  Bangalore  10000     500
1    138688           p2        Furniture  Bangalore  20000     400
2    108966           p3       Technology    Chennai  25000     200
3    114412           p4  Office Supplies    Chennai  30000     250
4    161289           p5       Technology  Bangalore  35000     800
5    118983           p6  Office Supplies  Bangalore  40000     700

In [16]:
# select max(sales) from df
df['sales'].max()

40000

In [17]:
# select category, max(sales) from df groupby category
df.groupby('category')['sales'].max()

category
Furniture          20000
Office Supplies    40000
Technology         35000
Name: sales, dtype: int64

In [25]:
# select category avg(sales), min(sales), max(sales), count(sales) from df groupby category, city
df.groupby('category')['sales']\
    .agg(['mean', 'max', 'min', 'count', 'sum']) # .agg([np.mean, np.max, np.min, 'count', np.sum]) # There's NO np.count

                    mean    max    min  count    sum
category
Furniture        15000.0  20000  10000      2  30000
Office Supplies  35000.0  40000  30000      2  70000
Technology       30000.0  35000  25000      2  60000

In [11]:
# select category,city, avg(sales), min(sales), max(sales), count(sales) from df groupby category, city
df.groupby(['category', 'city'])['sales']\
    .agg(['mean', 'max', 'min', 'count'])

                              mean    max    min  count
category        city
Furniture       Bangalore  15000.0  20000  10000      2
Office Supplies Bangalore  40000.0  40000  40000      1
                Chennai    30000.0  30000  30000      1
Technology      Bangalore  35000.0  35000  35000      1
                Chennai    25000.0  25000  25000      1

In [13]:
# select category avg(sales), max(profit) from df group by category
import numpy as np
df.groupby('category')\
    .agg({'sales': 'min', 'profit':'max'})

                 sales  profit
category
Furniture        10000     500
Office Supplies  30000     700
Technology       25000     800